{"data":{"site":{"siteMetadata":{"title":"Giacomo Debidda","author":"Giacomo Debidda"}},"markdownRemark":{"id":"0458d6d8-18a6-53bd-a5f9-3b01a0119d99","excerpt":"Some time ago I followed a data science course taught by Jeff Leek on Coursera. The course was so good and thorough that eventually they…","html":"<p>Some time ago I followed a data science course taught by Jeff Leek on Coursera. The course was so good and thorough that eventually they decided to split it into several courses and create a <a href=\"https://www.coursera.org/specializations/jhu-data-science\">data science specialization</a> out of it.\nDuring the course Jeff Leek mentioned that toward the end of the year he likes to compile a <a href=\"http://simplystatistics.org/2016/12/20/noncomprehensive-list-of-awesome/\">list of things other people did during the year</a>.</p>\n<p>I think it’s a nice idea, so I’ll make a list of the things I stumbled upon during the year and that I found interesting.</p>\n<p>Here it is:</p>\n<ul>\n<li>Nathan Yau posted a scary but entertaining visualization on <a href=\"http://flowingdata.com/2016/01/19/how-you-will-die/\">how you will die</a>. The analysis and data preparation was performed in R, while for the visualization he used D3.js.</li>\n<li>Omar Wagih created <a href=\"http://guessthecorrelation.com/\">Guess the Correlation</a>, a hilarious game where you try to guess how correlated the two variables in a scatter plot are.</li>\n<li>Toby Walsh published a <a href=\"https://arxiv.org/pdf/1602.06462v1.pdf\">short paper on AI and singularity</a>. Quite a different opinion than the one expressed by Ray Kurzweil in <a href=\"https://en.wikipedia.org/wiki/The_Singularity_Is_Near\">The Singularity is Near</a>.</li>\n<li>Clayton d’Arnault wrote a really interesting article about information overload, one of the biggest problem of our hyperconnected society. The title couldn’t be more appropriate: <a href=\"https://digitalculturist.com/drowning-in-a-sea-of-information-563a3160efbb#.2x8iotwh4\">Drowning in a Sea of Information</a>. I really like the paragraph about <a href=\"http://jessicaabel.com/2016/01/27/idea-debt/\">idea debt</a>.</li>\n<li>Someone created <a href=\"http://geon.github.io/programming/2016/03/03/dsxyliea\">dsxyliea</a>, a web page that gives you an idea about how people with dyslexia see text.</li>\n<li>Someone created an <a href=\"https://rawgit.com/osnr/horrifying-pdf-experiments/master/breakout.pdf\">Atari Breakout in a pdf</a>. You have to view the PDF in Chrome to be able to play it. The author created this game to show that PDF has its own JavaScript scripting (which uses a completely different standard library from the Javascript available in a browser).</li>\n<li>Two twin teenagers built a fusion reactor in their bedroom and posted an <a href=\"https://www.reddit.com/r/IAmA/comments/4tgsaz/iama_i_built_a_fusion_reactor_in_my_bedroom_ama/\">AMA on Reddit</a>.</li>\n<li>These guys created a really cool project about <a href=\"https://monterail.com/blog/2016/monterale_breweree_how_we_merge_passion_of_brewing_beer_with_iot/?utm_campaign=Breweree&#x26;utm_content=31202596&#x26;utm_medium=social&#x26;utm_source=twitter\">Beer and IoT</a>.</li>\n<li>Charles Scalfani wrote an article on <a href=\"https://medium.com/@cscalfani/why-experts-make-bad-teachers-ccaed2df029b#.rqtpbtiqf\">why experts make bad teachers</a>. Really, really interesting point of view.</li>\n<li>Rody Zakovich created a funny Sankey diagram on the <a href=\"https://public.tableau.com/views/SouthParkSeasonOneWordsAnalysis/TheWordsofSouthParkSeason1?:embed=y&#x26;:display_count=yes&#x26;:showVizHome=no\">most common swear words in South Park season 1</a>.</li>\n<li>Brandon Liu of <a href=\"http://pureinformation.net/\">pureinformation.net</a> created a beautiful map of New York where you can explore the <a href=\"http://pureinformation.net/building-age-nyc/#12/40.7457/-73.8841\">age of the buildings</a>. I love maps like this one. I want to build something similar in 2017.</li>\n<li>Jose Aguinaga wrote a hilarious article about the state of the Javascript ecosystem, now that a new framework/transpiler/shiny thing seems to pop up every single day. <a href=\"https://hackernoon.com/how-it-feels-to-learn-javascript-in-2016-d3a717dd577f#.iflg3l8s5\">How it feels to learn Javascript in 2016</a>.</li>\n<li>The University of Michigan created <a href=\"http://www.vizhealth.org/gallery/\">Visualizing Health</a>, a website which hosts a collection of visualizations on healthcare topics. All visualizations are distributed via a Creative Commons license, which allows anybody – academics, healthcare organizations, even for-profit businesses — to adapt them for their own objectives.</li>\n<li>Christopher Möller put together a nice list of resources on <a href=\"https://github.com/wbkd/awesome-interactive-journalism?utm_source=hackernewsletter&#x26;utm_medium=email&#x26;utm_term=fav\">interactive journalism</a>. I proptly starred this repository on my GitHub account.</li>\n<li>Deep Learning was the buzzword of 2016 (and probably it will be of 2017 too). This article about <a href=\"http://getdango.com/emoji-and-deep-learning/\">Emoji &#x26; Deep Learning</a> was a bit different from the usual neural network tutorial :-)</li>\n</ul>\n<p><em>Note: I was really tempted to steal some stuff from Jeff’s list, there were really some good links…</em></p>\n<h2>References</h2>\n<p>Jeff Leek’s <a href=\"http://simplystatistics.org/2016/12/20/noncomprehensive-list-of-awesome/\">“A non-comprehensive list of awesome things other people did in 2016”</a>.</p>","frontmatter":{"title":"Interesting things other people did in 2016","date":"December 29, 2016"}}},"pageContext":{"slug":"/2016-12-29-interesting-things-other-people-did-in-2016/","previous":{"fields":{"slug":"/2016-12-11-virtual-environments-with-virtualenvwrapper/"},"frontmatter":{"title":"Virtual environments with virtualenvwrapper"}},"next":{"fields":{"slug":"/2017-01-06-visualize-gml-files-with-d3/"},"frontmatter":{"title":"Visualize GML files with D3"}}}}