{"data":{"site":{"siteMetadata":{"title":"Giacomo Debidda","author":"Giacomo Debidda"}},"markdownRemark":{"id":"bf0eb7c1-bd71-53e1-88db-d613cd0222d5 >>> MarkdownRemark","excerpt":"I like to compile a list of things I stumbled upon during the year and that I found interesting. It’s an idea I adopted from Jeff Leek’s…","html":"<p>I like to compile a list of things I stumbled upon during the year and that I found interesting. It’s an idea I adopted from Jeff Leek’s blog <a href=\"https://simplystatistics.org/\">simply statistics</a>. If you are curious, here is the list from <a href=\"https://www.giacomodebidda.com/interesting-things-other-people-did-in-2016/\">2016</a>.</p>\n<p>Here is the list for 2017:</p>\n<ul>\n<li>Genius.com created a cool infographic about <a href=\"https://genius.com/a/infographic-how-dragon-ball-influenced-a-generation-of-hip-hop-artists\">how Dragon Ball influenced a generation of hip hop artists</a>.</li>\n<li>Nadieh Bremer created this amazing visualization of <a href=\"http://www.datasketch.es/january/code/nadieh/\">all fights in Dragon Ball Z</a> for her one year long project <a href=\"http://www.datasketch.es\">datasketches</a>. The amount of awesome things that both Nadieh and Shirley managed to do this year is just insane. Every time I had a look at their projects I was left wondering: “can I really use D3 to make <em>this</em>?”</li>\n<li>James Talmage and Damon Maneice created <a href=\"https://thetruesize.com\">thetruesize</a>, a web app that lets you select a country and drag and drop it wherever you want on Earth. I really like this app because it makes you realize how distorted the Mercator projection is when comparing the sizes of something really close to the poles (e.g. Greenland) to something on the Equator (e.g. Colombia).</li>\n<li>Russell Goldenberg open sourced <a href=\"https://pudding.cool/process/introducing-scrollama/\">Scrollama</a>, a lightweight JavaScript library for scrollytelling. Elliot Bentley at the Wall Street Journal released a similar library called <a href=\"https://wsj.github.io/two-step/\">TwoStep</a>. I have never used any of these scrolling libraries, but I definitely will in one of my next projects.</li>\n<li>plotly realeased <a href=\"https://plot.ly/products/dash/\">Dash</a>, a Python library to build reactive and interactive dashboards. I like Dash a lot, and I’ve already written about it <a href=\"https://www.giacomodebidda.com/visualize-earthquakes-with-plotly-dash/\">here</a> and <a href=\"https://www.giacomodebidda.com/reactive-dashboards-with-plotly-dash/\">here</a>. I plan to contribute to this project in 2018.</li>\n<li>Ventursky, a Czech meteorological company, created this <a href=\"https://www.ventusky.com\">astonishing real-time weather map</a>. Man, wind maps are sooo cool, I would watch them for hours…</li>\n<li><a href=\"http://unitethesefuckers.com/\">unitethesefuckers</a> is a news aggregator that helps you in getting a balanced perspective of what liberals and conservatives are reading.</li>\n<li>Vicki Boykis wrote <a href=\"http://veekaybee.github.io/2017/02/01/facebook-is-collecting-this/\">this article on how Facebook is collecting your data</a>. I was already considering quitting Facebook for some time. This piece gave me the final push.</li>\n<li>Sasha Trubetskoy made <a href=\"http://sashat.me/2017/06/03/roman-roads/?utm_source=hackernewsletter&#x26;utm_medium=email&#x26;utm_term=fav\">this cool subway-style map of Roman roads</a>.</li>\n<li>Matt Stiles created the visualization <a href=\"http://thedailyviz.com/2016/09/17/how-common-is-your-birthday-dailyviz/\">how common is your birthday</a>. I didn’t know that September was the busiest month for births. Apparently the 16th of April (my birthday) is not so common.</li>\n<li>Matt also published <a href=\"http://thedailyviz.com/2017/12/22/visualizing-more-than-a-decade-of-north-korean-defections/\">Visualizing more than a decade of North Korean defections</a>. I was really surprised to discover that North Korean women are three times more likely to defect than men.</li>\n<li>Ben Eater wrote a comprehensive guide on <a href=\"https://eater.net/?utm_source=hackernewsletter&#x26;utm_medium=email&#x26;utm_term=fav\">how to build an 8-bit computer from scratch</a>.</li>\n<li>Stefan Zapf and Christopher Kraushaar created a <a href=\"https://www.oreilly.com/learning/a-new-visualization-to-beautifully-explore-correlations?imm_mid=0ed213&#x26;cmp=em-data-na-na-newsltr_20170208\">solar correlation map</a>. I really like this new way of representing correlation, and I started making my own version with D3 and Vue.js (they used matplotlib). I will post it here on the blog when it’s ready.</li>\n<li>Eric Roston and Blacki Migliozzi wrote the series of articles <a href=\"https://www.bloomberg.com/graphics/2017-arctic/\">How a Melting Arctic Changes Everything</a></li>\n<li>Going from North Pole to South Pole, the New York Times published a <a href=\"https://www.nytimes.com/interactive/2017/05/18/climate/antarctica-ice-melt-climate-change.html?_r=0\">series of articles about Antarctica</a>. It’s a visual masterpiece.</li>\n<li>Ideo created this nice <a href=\"http://fontmap.ideo.com/\">Font map</a>.</li>\n<li>Russell Goldenberg and Dan Kopf created a cool dataviz about <a href=\"https://pudding.cool/2017/01/making-it-big/\">the unlikely odds of making it big</a>.</li>\n<li>The Pudding kept publishing a lot of really good stuff. I particularly liked this piece by Colin Morris: <a href=\"https://pudding.cool/2017/05/song-repetition/\">are Pop Lyrics Getting More Repetitive?</a></li>\n<li>One of the coolest things of 2017 were these <a href=\"https://yourlogicalfallacyis.com/\">critical thinking cards that help you avoiding logical fallacies</a>.</li>\n<li>Lazaro Gamio created a funny visualization based on a modified version of Chernoff Faces, a technique that maps multiple statistical values to the features of a face. He called his project <a href=\"https://www.axios.com/an-emoji-built-from-data-for-every-state-2408885674.html\">Emoji state of America</a>.</li>\n<li>I should follow Andy Kirk from Visualizing Data more consistently. In 2017 he published quite a few interesting articles about data visualizations. <a href=\"http://www.visualisingdata.com/2017/07/10-significant-visualisation-developments-january-june-2017/\">Here is a good one</a>.</li>\n<li>Uber released a visualization platform for the web. I already knew about <a href=\"http://deck.gl/\">deck.gl</a>, but it seems that they are releasing a complete framework to allow visual explorations of massive datasets. Xiaoji Chen talks about it <a href=\"https://eng.uber.com/atg-dataviz/\">here</a>.</li>\n<li>Adam Pearce at the New York Times wrote a nice article and dataviz when <a href=\"https://www.nytimes.com/interactive/2017/05/25/sports/basketball/lebron-career-playoff-points-record.html\">LeBron James overtook Michael Jordan as the top scorer in the entire NBA playoff history</a>. The level of smoothness of the transitions and animations in the chart is just incredible.</li>\n<li><a href=\"http://www.yegor256.com/best.html\">yegor256’s blog</a> has been a great discovery in 2017. His blog posts and his book <a href=\"http://www.yegor256.com/elegant-objects.html\">Elegant Objects</a> literally changed the way I think about object oriented code.</li>\n<li>The Center for Spatial Research at Columbia University, and the Masters in Peace Building at the Universidad de Los Andes collaborated in creating <a href=\"https://centerforspatialresearch.github.io/colombia_site/\">Conflict Urbanism: Colombia</a>. The project maps and visualizes crimes committed over a period of 30 years, with the hope of understanding the patterns and ramifications of the Colombian conflict.</li>\n<li>Marco Hernandez and Darren Long created a dataviz on <a href=\"http://multimedia.scmp.com/culture/article/passportIndex/\">the power of your passport</a>. South China Morning Post kept publishing really nice visualizations all year around. Here is <a href=\"http://multimedia.scmp.com/news/china/article/One-Belt-One-Road/europe.html\">another one</a>.</li>\n<li><a href=\"https://imgur.com/gallery/CG9w4?utm_source=hackernewsletter&#x26;utm_medium=email&#x26;utm_term=fav\">This guy made a camera that prints a GIF instantly</a>. I know, it’s not related to data visualizations, programming topics or python/js libraries, but it was just too cool not to share it.</li>\n</ul>","frontmatter":{"title":"Interesting things other people did in 2017","date":"December 31, 2017"}}},"pageContext":{"slug":"/2017-12-31-interesting-things-other-people-did-in-2017/","previous":{"fields":{"slug":"/2017-12-10-reactive-dashboards-with-plotly-dash/"},"frontmatter":{"title":"Reactive Dashboards with Plotly Dash"}},"next":{"fields":{"slug":"/2018-01-07-jupyter-notebook-on-hdf5-h5py-pytables-datashader/"},"frontmatter":{"title":"Jupyter notebook on HDF5, h5py, PyTables, Datashader"}}}}