{"data":{"site":{"siteMetadata":{"title":"Giacomo Debidda","author":"Giacomo Debidda"}},"markdownRemark":{"id":"06fea6ea-db2a-526a-b0b0-f42ff605d53a >>> MarkdownRemark","excerpt":"A README file is the first thing that someone encounters when he finds your project. It’s a public-facing measure of your work, so it’s…","html":"<p>A README file is the first thing that someone encounters when he finds your project. It’s a public-facing measure of your work, so it’s definitely a good idea to spend some time reading articles and guidelines about how to write it well. Other developers and your future self will thank you for a well-crafted README.</p>\n<blockquote>\n<p>For every hour of code you write, spend an hour writing your README.</p>\n<p>— <a href=\"https://blog.cwrichardkim.com/how-to-get-hundreds-of-stars-on-your-github-project-345b065e20a2\">Richard Kim</a></p>\n</blockquote>\n<p>There are many great resources about how to write a good README. Here I will summarize what I learned and add my perspective.</p>\n<p>I think that most articles miss the point that for different project <em>types</em> you need to structure the README in a different way, and to include different type of information.</p>\n<p>I can think about the following project types:</p>\n<ul>\n<li>library or tool</li>\n<li>project starter or project clone</li>\n<li>cookbook repository</li>\n<li>list of articles or resources on a topic</li>\n</ul>\n<p>I will try to describe, including some examples for each category, how a good README looks like.</p>\n<h2>Library or tool</h2>\n<p>Stephen Whitmore, author of <a href=\"https://github.com/noffle/art-of-readme\">The Art of README</a>, and Ken Williams, a PERL developer, say that a README is an <em>abstraction</em> for your project:</p>\n<blockquote>\n<p>Your documentation is complete when someone can use your module without ever having to look at its code. This is very important. This makes it possible for you to separate your module’s documented interface from its internal implementation (guts). This is good because it means that you are free to change the module’s internals as long as the interface remains the same.</p>\n<p>Remember: the documentation, not the code, defines what a module does.</p>\n<p>— Ken Williams</p>\n</blockquote>\n<p>Tom Preston Warner even suggests to <a href=\"http://tom.preston-werner.com/2010/08/23/readme-driven-development.html\">writing the README first</a>. I have never tried, but Tom’s reasons are very well sound: writing a README first gives you clarity about what you actually want to build, and lets you avoid some pitfalls when you start writing code.</p>\n<p>A developer who reads your README should be able to answer these questions:</p>\n<ol>\n<li>Does it solve my problem?</li>\n<li>Can I use this code?</li>\n<li>Can I trust this code?</li>\n</ol>\n<p>Let’s see how you can answer each one of these.</p>\n<h4>Does it solve my problem?</h4>\n<p>Ideally, your project name should be self-explanatory, and your project description should be a one-liner. You have to showing what your project is all about. Answer this question first, so if a developer discovers that your project is not what he needs, he can quickly move on. Write an Introduction and a Usage section to answer this question.</p>\n<blockquote>\n<p>[The Introduction] should be a few sentences that explain exactly what the purpose of the code is, why someone would want to use it, and how it works. Answer the what, why, and the how.</p>\n<p>— <a href=\"https://m.dotdev.co/how-to-write-a-readme-that-rocks-bc29f279611a\">Eric L. Barnes</a></p>\n</blockquote>\n<p>Have a look at the README of <a href=\"https://github.com/kennethreitz/pipenv\">Pipenv</a>. In half a page you can see a short description, an animated GIF, a list of features and user testimonials. In a few seconds you can understand if this is something that you may want to use or not.</p>\n<p>Everyone loves animated GIFs, and I think they are far superior to screenshots when it comes to show your project in action. If it’s applicable to your project, include an animated GIF. There are several tools for creating a GIF from a screen capture. I use <a href=\"https://www.maketecheasier.com/record-screen-as-animated-gif-ubuntu/\"><code class=\"language-text\">byzanz</code></a>.</p>\n<p>Some big projects heavily rely on nice screenshots and GIFs. For example, <a href=\"https://github.com/apache/incubator-superset\">Superset</a> includes a ton of screenshots to make you want to try it out, and add a link to the <a href=\"https://superset.incubator.apache.org/\">extensive documentation</a> for installation and configuration.</p>\n<p>I don’t think that a list of user testimonials is that important, but you should definitely include a list of features to give other developers a clear picture of what your project does.</p>\n<h4>Can I use this code?</h4>\n<p>You should include a section for the installation/configuration of your project and a section for some common usage. Be clear about your project requirements and dependencies. Does your project work only on Ubuntu? Have you tried on Windows or on a Mac?</p>\n<p>You should write which license your project is using. You can also omit this information in the README and include a LICENSE file instead, but adding the license type (not the entire text!) to the README doesn’t hurt. If you have a non-permissive license, stick it at the very top.</p>\n<h4>Can I trust this code?</h4>\n<p>The first thing I look when I find a new project is the date of the last commit. This gives me an idea whether the project is still maintained or not.</p>\n<p>Build badges and Continuous Integration can help you if you want to gain more trust from other developers. If your project becomes popular, you can also add a badge that shows the number of downloads per month. This could give you some social validation and persuade other developers to adopt your project. Badges look cool and you might overdo here. For each badge, consider: “what real value is this badge providing to the typical viewer of this README?”</p>\n<p>A developer might have additional questions about your project. Don’t forget to include some contact details (email, Twitter).</p>\n<h4>Additional sections</h4>\n<p>If you are aware of similar projects you can list them and maybe add a brief comparison with your project. For example, have a look at <a href=\"https://github.com/audreyr/cookiecutter\">Cookiecutter</a>. I don’t think it makes sense to add a very detailed comparison with other projects. Maybe you can write an article on your blog and link it in the README.</p>\n<p>If your project grows, you could add a FAQ section and a How to Contribute section.</p>\n<p>What about the changelog? I think that the information in the changelog is too detailed and not of much use for someone who sees your project for the first time. If we accept a README as an abstraction, it doesn’t really make sense to include a changelog in it. I think it’s better to have the changelog in a different file. Also, keep in mind that if your project grows the changelog will take too much space in the README.</p>\n<h2>Project starter or project clone</h2>\n<p>The README for a project starter is very similar to the one of a library.</p>\n<p>When I find a project starter I look for these things:</p>\n<ul>\n<li>Screenshots / GIF / Live demo: I want to see the project in action. Don’t underestimate even a simple screenshot! It’s a great driver for motivation. I know that if I take the time to install this project I will get a fully functional project.</li>\n<li>Installation / Quickstart: the documentation here must be concise. I don’t like to spend hours just to decide if I want to try it out or not.</li>\n<li>Features: does it have everything I want? Is there anything else that I can replace or remove? How can I do it?</li>\n<li>References: I want to know why the project starter is structured this way. It would probably be too long to write that in the README, but you can add a list of articles that I can read (e.g. maybe you decided to follow <a href=\"https://12factor.net/\">the twelve factors</a>).</li>\n<li>FAQs: if the project is big enough, I think it makes sense to add a section for the most common questions a developer might have about the project.</li>\n</ul>\n<p>A good example of a project starter is <a href=\"https://github.com/pydanny/cookiecutter-django\">Cookiecutter Django</a>, even if it lacks a screenshot of the web app. I also like <a href=\"https://github.com/sloria/cookiecutter-flask\">Cookiecutter Flask</a>, which is a lot less verbose and shows a nice screenshot of the project.</p>\n<p>In a project clone, a screenshot / GIF is even more important. Have a look at a Hacker News clone website built with Vue.js. See the difference between the <a href=\"https://github.com/vuejs/vue-hackernews\">boring, older version</a>, and the <a href=\"https://github.com/vuejs/vue-hackernews-2.0\">shiny, more recent version</a>. The older version has a brief set of instructions how to install it, run it, and includes a link to the Live demo. The newer version adds a nice screenshot, a list of features and an architecture overview.</p>\n<h2>Cookbook repository</h2>\n<p>With “Cookbook repository” I mean a repository where you have a set of small, standalone modules. You can call them recipes. Each recipe is independent of the other ones and performs a specific task, solves a particular problem or shows how to use a particular library across different scenarios.</p>\n<p>A good example of cookbook repository is <a href=\"https://github.com/stanfordjournalism/search-script-scrape\">Search-Script-Scrape: 101 webscraping and research tasks for the data journalist</a>. Each script focuses on a single task and can be used independently: you run it and it prints the answer you are looking for.</p>\n<p>Another good example is <a href=\"https://github.com/eriklindernoren/ML-From-Scratch\">Machine Learning From Scratch</a>, which contains bare bones Python implementations of some of the fundamental Machine Learning models and algorithms. </p>\n<p>The most important things in a cookbook repository are:</p>\n<ul>\n<li>Table of Contents: if the list of recipes is rather long and can be subdivided into smaller topics, create sections (e.g. Supervised Learning, Unsupervised Learning).</li>\n<li>Reproducibility: I should be able to run the scripts without any issue. The dependencies are clearly stated and there is a section to explain how to run them. If a script relies on external data, there is a link to the original dataset.</li>\n<li>Recipes are task-specific.</li>\n<li>Recipes are not too big.</li>\n<li>References: there are links to articles/resources to delve deeper into a specific topic (e.g. a script about how to use <a href=\"http://lxml.de/\">lxml</a> to perform web scraping on a particular website could have a short README with a list of articles about lxml and a screenshot of the target website).</li>\n</ul>\n<p>Keep in mind that on GitHub you can define a README in each directory, so you can include the necessary information where it is more relevant.</p>\n<div class='aaaaaaa'><pre class=\"editor editor-colors\"><div class=\"line\"><span class=\"syntax--text syntax--plain syntax--null-grammar\"><span>├──&nbsp;README.md</span></span></div><div class=\"line\"><span class=\"syntax--text syntax--plain syntax--null-grammar\"><span>├──&nbsp;sectionA</span></span></div><div class=\"line\"><span class=\"syntax--text syntax--plain syntax--null-grammar\"><span>│  &nbsp;├──&nbsp;README.md</span></span></div><div class=\"line\"><span class=\"syntax--text syntax--plain syntax--null-grammar\"><span>│  &nbsp;├──&nbsp;recipeA1.py</span></span></div><div class=\"line\"><span class=\"syntax--text syntax--plain syntax--null-grammar\"><span>│  &nbsp;├──&nbsp;recipeA2.py</span></span></div><div class=\"line\"><span class=\"syntax--text syntax--plain syntax--null-grammar\"><span>│  &nbsp;└──&nbsp;recipeA3.py</span></span></div><div class=\"line\"><span class=\"syntax--text syntax--plain syntax--null-grammar\"><span>├──&nbsp;sectionB</span></span></div><div class=\"line\"><span class=\"syntax--text syntax--plain syntax--null-grammar\"><span>│  &nbsp;├──&nbsp;README.md</span></span></div><div class=\"line\"><span class=\"syntax--text syntax--plain syntax--null-grammar\"><span>│  &nbsp;├──&nbsp;recipeB1.py</span></span></div><div class=\"line\"><span class=\"syntax--text syntax--plain syntax--null-grammar\"><span>│  &nbsp;└──&nbsp;recipeB2.py</span></span></div><div class=\"line\"><span class=\"syntax--text syntax--plain syntax--null-grammar\"><span>└──&nbsp;requirements.txt</span></span></div></pre></div>\n<h2>List of articles or resources on a topic</h2>\n<p>Sometimes a repository is just a curated list of resources: a list of links and short descriptions, and basically no code. With this category, I’m referring to all the repositories created with <a href=\"https://github.com/sindresorhus/awesome\">Awesome</a>. Using a repository for a curated list of resources is a great idea, because this way if you care about a topic, you can easily share your knowledge with other developers. Everyone can contribute by adding links to the articles that he finds interesting.</p>\n<p>In this kind of repository, the README <em>is</em> the repository, and most of what is valid for the other types of repositories is just not applicable. However, here is what I would like to find:</p>\n<ul>\n<li>Table of Content: especially if a topic is broad enough, there should be several well-defined sections. This is a must for this kind of project. Don’t write a single, unordered list of hundreds of articles. Use sections.</li>\n<li>How to contribute: if you want to gather all the good resources about a subject, make it easy for people interested in the subject to add the links to the articles that they found interesting.</li>\n<li>A basic code of conduct: if the project is very popular, probably it’s a good idea to have one.</li>\n</ul>\n<p>A great example of a curated list of resources is <a href=\"https://github.com/sindresorhus/awesome-nodejs\">Awesome Node.js</a>.\nOther examples are <a href=\"https://github.com/eyeseast/awesome-journalism\">awesome-journalism</a>, <a href=\"https://github.com/vinta/awesome-python\">awesome-python</a>, <a href=\"https://github.com/braydie/HowToBeAProgrammer\">HowToBeAProgrammer</a>, <a href=\"https://github.com/wearehive/project-guidelines\">project-guidelines</a>, and of course <a href=\"https://github.com/matiassingers/awesome-readme\">Awesome README</a>.</p>\n<h2>Resources</h2>\n<p>I wrote this article after reading several articles on how to write a great README. Here are the ones that you <em>have to</em> read:</p>\n<ul>\n<li><a href=\"https://github.com/noffle/art-of-readme\">The Art of README</a></li>\n<li><a href=\"http://tom.preston-werner.com/2010/08/23/readme-driven-development.html\">README driven development</a></li>\n<li><a href=\"https://m.dotdev.co/how-to-write-a-readme-that-rocks-bc29f279611a\">How to write a README that rocks</a></li>\n<li><a href=\"https://blog.cwrichardkim.com/how-to-get-hundreds-of-stars-on-your-github-project-345b065e20a2\">How To Get Thousands of Stars on Your Github Project</a></li>\n<li><a href=\"https://changelog.com/posts/top-ten-reasons-why-i-wont-use-your-open-source-project\">Top ten reasons why I won’t use your open source project</a></li>\n</ul>","frontmatter":{"title":"How to write a killer README","date":"July 29, 2017"}}},"pageContext":{"slug":"/2017-07-29-how-to-write-a-killer-readme/","previous":{"fields":{"slug":"/2017-07-28-pipenv/"},"frontmatter":{"title":"Pipenv"}},"next":{"fields":{"slug":"/2017-08-07-quickstart-python-projects-with-invoke/"},"frontmatter":{"title":"Quickstart Python projects with Invoke"}}}}