{"data":{"site":{"siteMetadata":{"title":"Giacomo Debidda","author":"Giacomo Debidda"}},"markdownRemark":{"id":"a83c6471-e13a-57d6-9b1f-162cc5c80c96 >>> MarkdownRemark","excerpt":"Last month at a  PyDataMunich  meetup I gave a short workshop on HDF5 and the python packages that we can use when dealing with HDF5 files…","html":"<p>Last month at a <a href=\"https://www.meetup.com/it-IT/PyData-Munchen/\">PyDataMunich</a> meetup I gave a short workshop on HDF5 and the python packages that we can use when dealing with HDF5 files.</p>\n<p>I started the workshop with this picture:</p>\n<p><img src=\"./h5py-pytables-refactor.png\" alt=\"The HDF5 stack in Python\" title=\"The HDF5 stack in Python\"></p>\n<p>As you can see, at the moment python developers have to make a choice between h5py and PyTables.</p>\n<p>h5py provides a low-level, pythonic interface to the entire C HDF5 library. PyTables takes a different route and provides high-level abstractions that can make your life easier when writing to HDF5 or searching data in a HDF5 file. It also implements compression and chunking for you. You could say PyTables is more “battery included”.</p>\n<p>I have more experience with PyTables, so I am a little bit biased towards it.</p>\n<p>What I really like about these projects is that they have very different philosophies, and for this reason the mainteners agreed to work together in creating a new python stack for HDF5.</p>\n<p>It took me quite a while to prepare this workshop, but it was a great opportunity to play with the <a href=\"http://www.nyc.gov/html/tlc/html/about/trip_record_data.shtml\">New York City taxi dataset</a> and try out <a href=\"https://github.com/bokeh/datashader\">Datashader</a>, an innovative data rasterization pipeline that can be used to create data visualizations from massive datasets.</p>\n<p>Here is an image I generated from the yellow taxis data from January 2015. Pickup locations are shown in blue. The pickup locations resulted from a search are shown in yellow.</p>\n<p><img src=\"./nyc-yellow-taxis-pickups.png\" alt=\"New York City yellow taxis pickups\" title=\"New York City yellow taxis pickups\"></p>\n<p>Snippets and notebook are available on <a href=\"https://github.com/jackdbd/hdf5-pydata-munich\">this GitHub repo</a>.</p>","frontmatter":{"title":"Jupyter notebook on HDF5, h5py, PyTables, Datashader","date":"January 06, 2018"}}},"pageContext":{"slug":"/2018-01-07-jupyter-notebook-on-hdf5-h5py-pytables-datashader/","previous":{"fields":{"slug":"/2017-12-31-interesting-things-other-people-did-in-2017/"},"frontmatter":{"title":"Interesting things other people did in 2017"}},"next":{"fields":{"slug":"/2018-08-21-export-a-geodataframe-to-spatialite/"},"frontmatter":{"title":"Export a GeoDataFrame to Spatialite"}}}}