{"data":{"site":{"siteMetadata":{"title":null,"author":null}},"markdownRemark":{"id":"e166bca0-9d7b-5cf9-b275-e9c9d05d583f","excerpt":"Knowing what changes to commit and when to commit them is a valuable skill that comes in handy either if you are working in a team or by…","html":"<p>Knowing what changes to commit and when to commit them is a valuable skill that comes in handy either if you are working in a team or by yourself. In this brief article I’ll try to describe some common best practices.</p>\n<h2>Atomic commits</h2>\n<p>First of all, a commit should be <a href=\"https://www.freshconsulting.com/atomic-commits/\">atomic</a>, namely it should be about one task or one fix. If you have changes which are completely unrelated, you should have different commits for each one of them.</p>\n<h2>Squashing? Yes please!</h2>\n<p>It’s good to commit early and often, but you probably don’t want to end up with a zillion tiny commits on a public branch. It’s very hard to read the history of that branch and go back to a specific snapshot where you (or another developer in you team) introduced the changes. You can instead commit many times on a feature branch, rewrite your local history by <a href=\"http://giacomodebidda.com/blog/squashing-git-commits/\">squashing several commits together</a> into a reasonable number of commits, and only then push your squashed commits to a public branch.\nThere are also <a href=\"http://stackoverflow.com/a/6544580\">some other strategies</a>, but I have to admit that I’m still not very comfortable with them.</p>\n<h2>The commit message</h2>\n<p>Writing a good commit message is an important skill to have, even when working in a small project. Remember that <em>the person who is most likely to read that commit messages is the developer who wrote it</em>, so it makes perfect sense to stop for a while and think carefully about what to write when committing some changes. It certainly takes some time to craft a good explanation of the changes introduced with a particular commit, but I think it’s time well spent.</p>\n<p>It’s tempting to use the shortcut <code class=\"language-text\">git commit -m</code>, but I try to avoid it. It makes me feel bad every time I can’t think about a way to express my changes into 50 characters or less.</p>\n<p>A commit message should start with a brief <strong>summary of 50 characters or less</strong>. This short text serves the purpose of explaining <em>what</em> these changes are about. Use the imperative mode (e.g. <em>Fix issue #1234</em>), not a past tense (e.g. <em>Fixed issue #1234</em>). This is consistent with the commit messages generated by commands like <code class=\"language-text\">git merge</code>. Also, don’t forget to use uppercase for the first letter in the summary.</p>\n<p>After the summary you should leave one blank line and write a more detailed <strong>description</strong> about our changes. It’s a good idea to wrap this text at <strong>72 characters</strong> per line. The length of this text depends on the commit itself: if you are committing only some small changes you might skip it altogether, while if you need to explain thoroughly the reasoning behind a given design implementation of a class or a function it might cover several lines of text.\nIf the description is really long, you can divide it into several paragraphs and leave a blank line after each one. If you have some bullet points, you should keep the indentation consistent.</p>\n<blockquote>\n<p>A good commit message should explain <em>what</em> you did (in the summary) and <em>why</em> you did it (in the description).</p>\n</blockquote>\n<p>Here is an example:</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/commit_1-71928545fb267a77d98c6469704ef11d-639eb.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; ; max-width: 559px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 45.61717352415026%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAJCAYAAAAywQxIAAAACXBIWXMAAAsSAAALEgHS3X78AAABfklEQVQoz3VR4XqjIBDMEzQxaYIKiCKoJJ5RYzS59v1fa7rQ1u+u392P+XYHdmdnYcOFQVWUUMrC5AY6txDS4jWtceRNgM//xInOTsKFOx+ZPId8H1tshKxQtQvyeoLr31G6GQXl1WVG0z3hrr9hnOfLF2YoOyAzPaTuQtT1DTxvEXnBlJfIyg7KDCiqMRSXzRQK/dRDUhOq1Y2HdxIxu8aImZD7uk2caFg3oh3ecLk+cCZH3fiOjrgfJIsWIr+A6ys5qLBnGofY/I3EBLGwspQlTlkPVkw4ZgOhJz6A5RNOakSsZ8op0n2U/kLEh8/4Dd5jn7YkTI69w0IZ7OQT23TEji63/EaYsBV0xu944UvgL2LBTsyhdifuiMSNQD3yEUS90yCog+CdBNtg+TXtsOcd8YYGdFT8yX1TFJz8XLlcxbzLTU6CsXhA8Sd4tsBRbtIbdHIFj5uvJrtG3/gvrCurzOJIb5EkDommXyzOYKlDyWoo+kH2Pf1H4+E/+ADzW/ceaPBa/AAAAABJRU5ErkJggg=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"explain what you did (in the summary) and why you did it\"\n        title=\"A good commit message\"\n        src=\"/static/commit_1-71928545fb267a77d98c6469704ef11d-639eb.png\"\n        srcset=\"/static/commit_1-71928545fb267a77d98c6469704ef11d-4cbcd.png 148w,\n/static/commit_1-71928545fb267a77d98c6469704ef11d-85067.png 295w,\n/static/commit_1-71928545fb267a77d98c6469704ef11d-639eb.png 559w\"\n        sizes=\"(max-width: 559px) 100vw, 559px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<h2>Why 72 characters? And how to do it?</h2>\n<p>The reason behind 72 characters is that git commands like <code class=\"language-text\">git log</code> don’t do any special wrapping, so if you enter them in a 80 column terminal, and if you need to reserve 4 columns for left indentation and 4 for right indentation, you are left with 72 columns.</p>\n<p>A really handy way to have syntax highlighting and automatic text wrapping is writing commit messages using Vim. You can set Vim as the default editor for git either by opening a terminal and entering <code class=\"language-text\">git config --global core.editor &quot;vim&quot;</code>, or by locating our .gitconfig file (it’s in the <code class=\"language-text\">home</code> folder in Linux) and adding an entry in the <code class=\"language-text\">[core]</code> section (or create that section if is missing).</p>\n<div class=\"gatsby-highlight\" data-language=\"shell\"><pre class=\"language-shell\"><code class=\"language-shell\"># .gitconfig\n[core]\n    editor = vim</code></pre></div>\n<p>Then you need to configure Vim. Locate the <code class=\"language-text\">.vimrc</code> file in the <code class=\"language-text\">home</code> folder (or create one if it’s missing) and copy/paste the content of the example file you can find <a href=\"http://vim.wikia.com/wiki/Example_vimrc\">here</a> to have 50 character limit on the first line, text wrap to 72 characters for the commit message description, syntax highlighting and line numbers.\nIf you are curious why you can’t find these settings in the text you just pasted in the <code class=\"language-text\">.vimrc</code> file, it’s because Vim understands automatically that we are writing a gitcommit file, and uses a specific setting with them. We can check these settings by typing <code class=\"language-text\">:set</code> in command mode while we are about to commit our changes. We will see some entries like <code class=\"language-text\">filetype=gitcommit</code> and <code class=\"language-text\">textwidth=72</code>.</p>\n<h2>References</h2>\n<p>Here are some additional resources on writing great commit messages:</p>\n<ul>\n<li><a href=\"https://robots.thoughtbot.com/5-useful-tips-for-a-better-commit-message\">5 useful tips for a better commit message</a></li>\n<li><a href=\"http://tbaggery.com/2008/04/19/a-note-about-git-commit-messages.html\">A note about git commit messages</a></li>\n<li><a href=\"http://sethrobertson.github.io/GitBestPractices/\">Git best practices</a></li>\n<li><a href=\"http://chris.beams.io/posts/git-commit/\">Git commit</a></li>\n</ul>","frontmatter":{"title":"Better Git commits","date":"December 04, 2016"}}},"pageContext":{"slug":"/better-git-commits/","previous":{"fields":{"slug":"/2016-11-26-facade-pattern-in-python/"},"frontmatter":{"title":"Façade pattern in Python"}},"next":null}}